---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationZ
source: html/cb976ebd-9c23-b53b-e2ec-36ea25f5fc9c.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLinkType.TranslationZ Property

Fixity of translation along Z.

## Syntax (C#)
```csharp
public AnalyticalFixityState TranslationZ { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The fixity state translationZ is not valid for Analytical Link Type parameters.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration